#задание 1

#group = [
 #   ['Нерослов С.В.', "1991", "женат","высшее","работает","есть дети"],
 #   ["Коробицын И.К.","1969","женат","среднее","на пенсии","есть дети"],
 #   ["Собалева М.Н.","1999","не замужем","высшее","не работает","нет детей"]
#]
#print(group[0])
#задание 2
group = {
    ("Нерослов", "Сергей", "Вячеславовч"):
        {"Род" :"1991", "Семейное положение":"женат",
         "Образование":"высшее", "Занятость":"работает",
         "количество детей":"один ребенок"}}
print(group)