#задание 1
#print("Введите критерий поиска")
#y=input()
#group = [
#    ["Нерослов С.В.", "1991", "женат","высшее","работает","есть дети"],
#    ["Коробицын И.К.","1969","женат","среднее","на пенсии","есть дети"],
#    ["Собалева М.Н.","1999","не замужем","высшее","не работает","нет детей"]
#]
#for i in group:
#    for b in i:
#        if b==y:
#            print(i)
#else: print("нет совпадений")

#задание 2
print("Введите критерий поиска")
y=input()
group = {
    ("Нерослов", "Сергей", "Вячеславовч"):
        {"Род" :"1991", "Семейное положение":"женат",
         "Образование":"высшее", "Занятость":"работает",
         "количество детей":"один ребенок"},
    ("Коробицын", "Инокентий", "Константинович"):
        {"Род": "1969", "Семейное положение": "женат",
         "Образование": "среднее", "Занятость": "на пенсии",
         "количество детей": "три ребенка"},
    ("Собалева", "Мария", "Николаевна"):
        {"Род": "1999", "Семейное положение": "не замужем",
         "Образование": "высшее", "Занятость": "не работает",
         "количество детей": "нет"}
}
for i,b in group.items():
    for k in b.values():
        if k==y:
            print(" ".join(i), b)
else: print("нет совпадений")


